ShortMesh/nozzle2DAttempt_turbulent_short_longrun_finemesh_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          614;
        startFace       62761;
    }
    outlet
    {
        type            patch;
        nFaces          125;
        startFace       63375;
    }
    inlet
    {
        type            patch;
        nFaces          111;
        startFace       63500;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          63322;
        startFace       63611;
    }
)

// ************************************************************************* //
