ShortMesh/nozzle2DAttempt_turbulent_short_longrun_finemesh_1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 612;


boundaryField
{
	wall
	{
		type		zeroGradient;
	}

    	outlet
    	{
        	type            waveTransmissive;
        	field           p;
        	psi             thermo:psi;
        	gamma           1.3;
        	fieldInf        0.0001;
        	lInf            1;
        	value           uniform 0.0001;
    	}
    	
	inlet
    	{
   	     	type            fixedValue;
		value		uniform 612;
    	}		

    	frontAndBackPlanes
    	{
        	type            empty;
    	}
}


// ************************************************************************* //
